In [ ]:
#Exp no : 3

In [3]:
#Aim: Basic of Data Frame

In [2]:
#Name: Shruti Giri
#Roll no: 17
#Sec: C
#Subject: ET 1

# Creating Series

In [3]:
# Program for creating Series using series() method of Pandas Library

In [4]:
#Import Pandas library
import pandas as pd

In [5]:
#Creating Student Name List
Name=["Shruti","Sagar","Sanika","Lovely","Rohan"]
Name

['Shruti', 'Sagar', 'Sanika', 'Lovely', 'Rohan']

In [6]:
#Creating a Series 
Roll_list=pd.Series(Name,index=[1,2,3,4,5])
print(Roll_list)

1    Shruti
2     Sagar
3    Sanika
4    Lovely
5     Rohan
dtype: object

# Creating Data Frame

In [7]:
#Import Pandas library
import pandas as pd

In [8]:
#Creating Data Frame
df=pd.DataFrame([[10,12,14,16],[11,18,15,21],[12,13,14,15]],
columns= ["BIA","DBMS","DSS","CAO"])

In [9]:
df

   BIA  DBMS  DSS  CAO
0   10    12   14   16
1   11    18   15   21
2   12    13   14   15

In [10]:
df.shape

(3, 4)

In [11]:
df.size

12

In [12]:
df.ndim

2

# Adding record to the data frame

In [13]:
df2=pd.DataFrame([[5,6,7,8]],
columns= ["BIA","DBMS","DSS","CAO"])

In [14]:
df3=df.append(df2,ignore_index=True)

In [15]:
df3

   BIA  DBMS  DSS  CAO
0   10    12   14   16
1   11    18   15   21
2   12    13   14   15
3    5     6    7    8

# Adding Attribute name DM

In [16]:
df3["DM"]=[12,15,16,14]

In [17]:
df3

   BIA  DBMS  DSS  CAO  DM
0   10    12   14   16  12
1   11    18   15   21  15
2   12    13   14   15  16
3    5     6    7    8  14

# Deleting Record from df3 dataframe

In [18]:
df4=df3.drop(index=[1])

####

In [19]:
df4

   BIA  DBMS  DSS  CAO  DM
0   10    12   14   16  12
2   12    13   14   15  16
3    5     6    7    8  14

# Deleting Attribute from df3 dataframe

In [20]:
df5=df3.drop(columns=["DM"])

In [21]:
df5

   BIA  DBMS  DSS  CAO
0   10    12   14   16
1   11    18   15   21
2   12    13   14   15
3    5     6    7    8

In [22]:
#Finding mean of DSS 

print("Mean of DSS:", df5["DSS"].mean())

Mean of DSS: 12.5

In [23]:
#Finding median of DSS

print("Median of DSS:", df5["DSS"].median())

Median of DSS: 14.0

In [24]:
#Finding mode of DSS

print("Mode of DSS:", df5["DSS"].mode())

Mode of DSS: 0    14
dtype: int64

In [25]:
#Finding max number of DSS

print("Max of DSS:", df5["DSS"].max())

Max of DSS: 15

In [26]:
#Finding Min number of DSS

print("Max of DSS:", df5["DSS"].min())

Max of DSS: 7